client/result/nodejs/result-nodejs-1500-2.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        
Server Hostname:        192.168.5.160
Server Port:            8124

Document Path:          /
Document Length:        80 bytes

Concurrency Level:      128
Time taken for tests:   0.235 seconds
Complete requests:      1500
Failed requests:        678
   (Connect: 0, Receive: 523, Length: 155, Exceptions: 0)
Write errors:           926
Total transferred:      195624 bytes
HTML transferred:       109440 bytes
Requests per second:    6383.85 [#/sec] (mean)
Time per request:       20.051 [ms] (mean)
Time per request:       0.157 [ms] (mean, across all concurrent requests)
Transfer rate:          813.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        7   18   8.6     16      55
Processing:     0    1   2.6      0      18
Waiting:        0    2   1.7      2      15
Total:          7   19   8.5     17      55

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     20
  75%     21
  80%     23
  90%     29
  95%     40
  98%     46
  99%     55
 100%     55 (longest request)