client/result/nodejs/result-nodejs-200-4.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        
Server Hostname:        192.168.5.160
Server Port:            8124

Document Path:          /
Document Length:        80 bytes

Concurrency Level:      128
Time taken for tests:   0.032 seconds
Complete requests:      200
Failed requests:        53
   (Connect: 0, Receive: 31, Length: 22, Exceptions: 0)
Write errors:           82
Total transferred:      24739 bytes
HTML transferred:       13840 bytes
Requests per second:    6297.43 [#/sec] (mean)
Time per request:       20.326 [ms] (mean)
Time per request:       0.159 [ms] (mean, across all concurrent requests)
Transfer rate:          760.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   10   5.4      9      22
Processing:     0    4   4.7      2      16
Waiting:        0    4   3.8      2      15
Total:          7   15   5.0     14      24

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     18
  75%     20
  80%     21
  90%     22
  95%     22
  98%     23
  99%     24
 100%     24 (longest request)