client/result/nodejs/result-nodejs-500-2.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        
Server Hostname:        192.168.5.160
Server Port:            8124

Document Path:          /
Document Length:        80 bytes

Concurrency Level:      128
Time taken for tests:   0.074 seconds
Complete requests:      500
Failed requests:        270
   (Connect: 0, Receive: 216, Length: 54, Exceptions: 0)
Write errors:           256
Total transferred:      64779 bytes
HTML transferred:       36240 bytes
Requests per second:    6773.23 [#/sec] (mean)
Time per request:       18.898 [ms] (mean)
Time per request:       0.148 [ms] (mean, across all concurrent requests)
Transfer rate:          856.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        7   15   4.8     14      24
Processing:     0    2   3.7      0      18
Waiting:        0    3   2.4      3      14
Total:          7   17   4.8     18      27

Percentage of the requests served within a certain time (ms)
  50%     18
  66%     19
  75%     22
  80%     23
  90%     24
  95%     24
  98%     25
  99%     27
 100%     27 (longest request)