client/result/nodejs/result-nodejs-500-4.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        
Server Hostname:        192.168.5.160
Server Port:            8124

Document Path:          /
Document Length:        80 bytes

Concurrency Level:      128
Time taken for tests:   0.072 seconds
Complete requests:      500
Failed requests:        193
   (Connect: 0, Receive: 166, Length: 27, Exceptions: 0)
Write errors:           280
Total transferred:      67496 bytes
HTML transferred:       37760 bytes
Requests per second:    6936.64 [#/sec] (mean)
Time per request:       18.453 [ms] (mean)
Time per request:       0.144 [ms] (mean, across all concurrent requests)
Transfer rate:          914.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        5   13   4.3     14      22
Processing:     0    3   5.5      0      23
Waiting:        0    4   4.1      3      20
Total:          9   17   4.4     17      29

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     19
  75%     20
  80%     20
  90%     21
  95%     24
  98%     28
  99%     28
 100%     29 (longest request)